# DPartReinforcementDeleted Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarSystemFailures..::..DPartReinforcementDeleted Property
BuiltInFailures..::..RebarSystemFailures Class See Also
---
Reinforcement hosted on highlighted Parts will be deleted.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DPartReinforcementDeleted { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DPartReinforcementDeleted As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DPartReinforcementDeleted {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarSystemFailures Class
Autodesk.Revit.DB Namespace